{
  "kind": "build_request",
  "title": "Param Shopping Marketing App",
  "projectName": "Param Shopping",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Create a marketing landing page for 'Param Shopping' (app ID: com.paramshopping.app) that includes a hero section with the app name and tagline, a features/benefits section highlighting the shopping app's key value propositions, a call-to-action section (e.g., 'Download Now' or 'Get Started'), and a footer with the app ID branding.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Create a marketing app of the URL id com.paramshopping.app"
        ]
      },
      "acceptanceCriteria": [
        "Landing page displays 'Param Shopping' as the app name prominently",
        "Hero section includes a compelling tagline and primary CTA button",
        "Features section lists at least 3 shopping app benefits with icons or visuals",
        "Footer includes 'com.paramshopping.app' branding",
        "Page is fully responsive on mobile, tablet, and desktop"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Apply a vibrant, modern e-commerce visual theme to the marketing app using warm accent colors (e.g., orange/red/coral tones), clean sans-serif typography, and a layout that feels energetic and trustworthy. Enforce the theme consistently across all sections.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ]
      },
      "acceptanceCriteria": [
        "Consistent color palette with warm accent tones used throughout",
        "Typography is clean and readable with clear visual hierarchy",
        "All sections follow the same design language",
        "Visual theme feels appropriate for a shopping/retail app"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Store and expose basic marketing content (app name, tagline, feature list, CTA text) from the backend so the frontend can fetch and render it dynamically.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-2"
        ]
      },
      "acceptanceCriteria": [
        "Backend actor exposes a query function to retrieve marketing content",
        "Marketing content includes app name, tagline, list of features, and CTA label",
        "Frontend successfully fetches and renders content from the backend"
      ]
    }
  ],
  "constraints": [
    "App package/URL ID must be com.paramshopping.app — use this consistently in branding and footer",
    "All user-facing text must be in English"
  ],
  "nonGoals": [
    "Actual e-commerce or shopping functionality (cart, checkout, product listings)",
    "User authentication or account management",
    "Payment processing",
    "Real-time features or push notifications"
  ],
  "imageRequirements": {
    "required": [
      "Vibrant shopping bag logo with a stylized 'P' monogram in warm orange tones on a clean white background (param-shopping-logo.dim_256x256.png)",
      "Wide marketing hero banner with abstract shopping and retail elements, warm gradient background in coral and orange tones (hero-banner.dim_1440x600.png)"
    ],
    "edits": []
  }
}